Repository: 84000/data-translation-memory
Catalog: toh507-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱི་སྙིང་པོ་གསང་བ་རིང་བསྲེལ་གྱི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Dhāraṇī “The Receptacle of Secret Relics, Quintessence of the Blessings of All the Thus-Gone Ones”

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡུལ་མ་ག་དྷཱ་ན་དྲི་མ་མེད་པའི་ཀུན་དགའ་ར་བ་དང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྫིང་ན་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཆེན་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་བྱེ་བ་མང་པོ་རྣམས་དང་། ཡུལ་གྱི་མི་འབུམ་ཕྲག་དུ་མ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བྱས་ནས་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Blessed One was dwelling in Magadha at a pool made of the seven precious materials in the Stainless Pleasure Grove, together with a great congregation of bodhisattvas, a great congregation of hearers, and several tens of millions of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans, and hundreds of thousands of local people, all of whom surrounded and esteemed him.

source: །དེ་ནས་འཁོར་གྱི་ནང་དེ་ན་བྲམ་ཟེ་ཆེན་པོ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་མཁས་པ། མཛངས་པ། གསལ་བ་ཡིད་གཞུངས་པ། མཐོང་ན་དགའ་བ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་བཟུང་བ།
en: Among this retinue was a great brahmin who was like a great sal tree, who was skilled, astute, clear-minded, and handsome to behold, and who upheld the path of the ten virtuous deeds.

source: དྲི་མེད་ལེགས་སྣང་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: He was called Stainless Glow.

source: དེ་ཡང་གཅིག་ཏུ་དཀོན་མཆོག་གསུམ་ལ་དད་ཅིང་གུས་ལ་ཕྱག་བྱེད་པའི་དགེ་བའི་བསམས་པ་དང་ལྡན་པ། ཞིབ་མོ་བརྟགས་པ། སེམས་ཅན་ཐམས་ཅད་དང་དགེ་བའི་དོན་ལ་བརྩོན་པ།
en: Endowed with the virtuous mindset of paying homage only to those who have faith in and respect for the Three Jewels, he examined things in detail and persevered for the sake of virtue and of all sentient beings.

source: ནོར་ཆེ་བ། ལོངས་སྤྱོད་ཆེ་བ། ཕྱུག་པ། རྫས་མང་བ། ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: He had great wealth and expansive enjoyments, was affluent, and had many possessions and abundant provisions.

source: །དེ་ནས་བྲམ་ཟེ་ཆེན་པོ་དྲི་མེད་ལེགས་སྣང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཡང་བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་དང་། བདུག་པས་མངོན་པར་མཆོད་དོ། །ན་བཟའ་རིན་འབུམ་རི་བ་ཡང་གསོལ།
en: The great brahmin Stainless Glow went to the Blessed One and circumambulated him seven times, worshiping him with flowers and incense.

source: བཅོམ་ལྡན་འདས་ལ་མུ་ཏིག་གི་དོ་ཤལ་འབུམ་རི་བ་ཡང་གསོལ་ནས་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: He presented him with a very costly robe and an expensive pearl necklace and prostrated at the Blessed One’s feet.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སྲས་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ། བདག་གི་སྡུམ་པར་གདུགས་ཚོད་ལ་སྤྱན་འདྲེན་ན་དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བར་མཛད་པར་ཅི་གནང་།
en: Sitting down before the Blessed One, he asked, “Would the Blessed One agree to be invited, along with your retinue of bodhisattva sons, to take your midday meal at my home?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་ཆེན་པོ་དྲི་མེད་ལེགས་སྣང་གིས་སྤྱན་དྲངས་པར་ཐུགས་སུ་ཆུད་ནས་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་ངོ་།
en: The Blessed One considered this invitation by the great brahmin Stainless Glow and consented by remaining silent.

source: །དེ་ནས་བྲམ་ཟེ་ཆེན་པོ་དྲི་མེད་ལེགས་སྣང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་དེས་རིངས་པ་རིངས་པར་རང་གི་ཁྱིམ་དུ་སོང་སྟེ།
en: The great brahmin Stainless Glow knew that by remaining silent the Blessed One had accepted his invitation, and so he promptly returned home.

source: དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་པ་དང་། ཞལ་ཟས་དང་། ཡོ་བྱད་དང་། ཞལ་ཟས་རོ་བརྒྱ་པ།
en: When the night had passed, he arranged many foods, provisions, and delicacies.

source: མང་པོ་བཤམས་ནས་བཀོད་པ་ཆེན་པོས་བཀྲ་ཤིས་ཀྱི་གཞལ་མེད་ཁང་དང་། གཞལ་མེད་ཁང་ཆེན་པོ་སྣ་ཚོགས་དང་། མེ་ཏོག་དང་། བདུག་པ་ཁྱེར་ཏེ།
en: Along with this great array of foodstuffs, he carried an auspicious palanquin, a variety of large palanquins, flowers, and incense.

source: འཁོར་མང་པོ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་དུས་ལ་བབ་པར་གསོལ་ཏོ།
en: With a large entourage, cymbals, and percussion instruments, he went to the Blessed One to inform him that the time had come.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྲམ་ཟེ་ཆེན་པོ་དྲི་མེད་ལེགས་སྣང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ནི་གཤེགས་པའི་དུས་ལགས་ཏེ།
en: The great brahmin Stainless Glow told the Blessed One, “O Blessed One, the time has come.

source: བཅོམ་ལྡན་འདས་གཤེགས་པའི་དུས་ཀྱི་ཚོད་ལ་བབ་ན་བདག་ལ་གནང་བར་མཛད་པར་ཅི་གནང་།
en: Now that it is time, would the Blessed One agree to come with me?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་ཆེན་པོ་དྲི་མེད་ལེགས་སྣང་དབུགས་ཕྱུང་ནས་ཉིད་ཀྱི་འཁོར་ལ་གཟིགས་ཏེ་བཀའ་སྩལ་པ། འཁོར་ཇི་ལྟར་ལྷགས་པ་ཐམས་ཅད་དེང་དོན་ཆེན་པོ་མཛད་པར་འགྱུར་གྱིས་ཚུར་ཤེག །
en: The Blessed One reassured the great brahmin Stainless Glow; looking at him and his entourage, he said, “Since all of you gathered here in this retinue will accomplish a great purpose today, let us go!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་གདན་དེ་ལས་བཞེངས་ནས།
en: The Blessed One then rose from his seat.

source: བཅོམ་ལྡན་འདས་གདན་དེ་ལས་བཞེངས་མ་ཐག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལས་འོད་ཟེར་ཐ་དད་པ་སྣ་ཚོགས་བྱུང་སྟེ།
en: As soon as he had risen, multicolored light rays manifested from his body.

source: འོད་ཟེར་གྱི་སྣང་བ་དེས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བར་བྱས་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཡང་དག་པར་བསྐུལ་ཏེ།
en: The brilliance of these rays of light illuminated all the buddha fields of the ten directions, exhorting all the thus-gone ones.

source: གཟིགས་ནས་གཤེགས་པར་ཤེས་སོ།
en: Having beheld this, the great brahmin knew that the Blessed One was about to leave.

source: །དེ་ནས་བྲམ་ཟེ་ཆེན་པོ་དྲི་མེད་ལེགས་སྣང་གིས་མཆོད་པ་དང་། བཀུར་སྟི་ཆེན་པོས་མཆོད་ཅིང་བཅོམ་ལྡན་འདས་ཀྱི་གཤེགས་ཤུལ་མཛེས་པ་ཆེར་བྱས་སོ། །འཁོར་མང་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: The great brahmin Stainless Glow worshiped him with offerings and great honor and beautified the Blessed One’s route.

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་།
en: The large entourage; the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas; and Śakra, Brahmā, the protectors of the world, Maheśvara, Nārāyaṇa, and the Four Great Kings also beautified his route.

source: སྲེད་མེད་ཀྱི་བུ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཀྱང་གཤེགས་ཤུལ་མཛེས་པར་བྱས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དང་ཧ་ཅང་མི་རིང་བའི་ལམ་གྱི་བར་གྱི་ནང་ཞིག་ན་སྐྱེད་མོས་ཚལ་བདེ་བྱེད་ཅེས་བྱ་བ་ཞིག་ཡོད་དོ།
en: Not far from the Blessed One’s path was a park called Pleasurable.

source: །སྐྱེད་མོས་ཚལ་དེའི་ནང་ན་མཆོད་རྟེན་རྙིང་པ་ཆེན་པོ་ཞིག་ཡོད་དེ། ཞིག་པ།
en: In this park was a great old stūpa.

source: ཚེར་མས་གང་བ་རྩྭ་དང་། ཤིང་དང་། གྱོ་མོས་ཀུན་ཏུ་གང་བ་ཕྱག་དར་གྱི་ཕུང་པོ་ལྟ་བུ་ཞིག་ཡོད་དོ།
en: Derelict, overgrown with brambles, and totally covered in grass, trees, and gravel, it resembled a heap of rubbish.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེའི་དྲུང་དུ་གཤེགས་པ་དང་། མཆོད་རྟེན་རྙིང་པ་ཕྱག་དར་གྱི་ཕུང་པོ་ལྟ་བུ་དེ་ཡང་ཀུན་ནས་འབར་ཞིང་འོད་ཟེར་འབར་བ་ཁ་དོག་སྣ་ཚོགས་པ་དག་བྱུང་ངོ་།
en: When the Blessed One approached it, the old stūpa resembling a rubbish heap blazed forth, emitting blazing light rays of various colors.

source: །ཕྱག་དར་དང་གྱོ་མོའི་ཕུང་པོ་དེ་ལས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: From the heap of rubbish and gravel the sound “Excellent!”

source: །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལེགས་སོ་ལེགས་སོ།
en: came forth. “Excellent, excellent is the Thus-Gone One, the Sage of the Śākyas!

source: །དེང་ནི་གཤེགས་པའི་ལྟས་བཟང་པོའོ།
en: It is a good omen that you have come here today.

source: །བྲམ་ཟེ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་སྤྱན་དྲངས་པ་ན་ཡང་ཁྱོད་ལེགས་སོ།
en: O great brahmin, it is excellent that you have invited the Thus-Gone One.

source: །དེང་ཁྱོད་ལ་དོན་ཆེན་པོ་མཛད་པར་འགྱུར་རོ།
en: Today you have accomplished a great purpose!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་མཆོད་རྟེན་རྙིང་པ་ཕྱག་དར་གྱི་ཕུང་པོ་ལྟ་བུ་དེ་ལ་ཡན་ལག་ལྔས་ཕྱག་མཛད་ནས་ལན་གསུམ་བསྐོར་བ་མཛད་ནས།
en: The blessed Thus-Gone One then prostrated with the five points of his body in front of the old stūpa that resembled a rubbish heap and circumambulated it three times.

source: ཉིད་ཀྱི་སྐུ་ལས་ན་བཟའ་གསིལ་ནས་མཆོད་རྟེན་རྙིང་པ་ཕྱག་དར་གྱི་ཕུང་པོ་ལྟ་བུ་དེ་ལ་གསོལ་ཏེ།
en: He took the robes from his own body and offered them to the old stūpa resembling a rubbish heap.

source: བཅོམ་ལྡན་འདས་ཀྱིས་མཆི་མ་བྱུང་བ་ཆེན་པོ་ཕྱུང་བས་བཤུམས་པ་མཛད་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་བསྟན་ཏོ།
en: The Blessed One wept profusely and then smiled.

source: །འཛུམ་པ་བསྟན་པ་དེས་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལག་མཐིལ་ན་བཞུགས་པ་བཞིན་དུ་མཐོང་ངོ་།
en: Because of his smile, all the thus-gone ones of the ten directions could be seen as if they were in the palm of one’s hand. The eyes of all the thus-gone ones, too, filled with tears.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་འོད་ཟེར་བཀྱེ་སྟེ། མཆོད་རྟེན་རྙིང་པའི་ཕུང་པོ་ཆེན་པོ་དེར་ཞུགས་སོ།
en: All the thus-gone ones also emitted light rays, which entered the great heap that was the old stūpa.

source: །དེ་ནས་འཁོར་མང་པོ་འདུས་པ་དེ་དག་ཡ་མཚན་ཆེན་པོར་གྱུར་ཅིང་ཡིད་ཆེས་ཏེ་འཁོད་པར་གྱུར་ཏོ།
en: The many assemblies gathered there marveled and were infused with trust.

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལུས་ནི་འདར། སྙིང་ནི་འགུལ།
en: The body of the great yakṣa commander, Vajrapāṇi, trembled, and his heart pounded.

source: རྡོ་རྗེ་ནི་གསོར་ཞིང་རིངས་པ་རིངས་པར་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Grabbing his scepter, he swiftly went to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He prostrated at the Blessed One’s feet, and said to the Blessed One, “What, O Blessed One, is the presage causing the Blessed One to weep?

source: །བཅོམ་ལྡན་འདས་བཤུམས་པའི་སྔ་ལྟས་ཆེན་པོ་གདའ་བ་གང་གིས་ན་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་མཆི་མས་གང་བར་བསྟན་པའི་སྔ་ལྟས་གདའ་བ་བཅོམ་ལྡན་འདས་ཅི་ལགས།
en: What is the presage causing the Blessed One’s eyes to fill with tears?

source: ཅིའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་འདིའི་ནང་དུ་ཞུ་བ་འདི་སྐབས་དབྱེ་བར་ཅི་གནང་།
en: Would the Blessed One grant me an opportunity to ask, on behalf of those in this assembly, why this is the case?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལག་ན་རྡོ་རྗེ་རིང་བསྲེལ་གྱི་ཕུང་པོ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཏིལ་གྱི་གང་བུ་སྙེད་ཐམས་ཅད་ཀྱི་སྙིང་པོའི་གཟུངས་ཀྱི་ཕྱག་རྒྱའི་མཆོད་རྟེན་གྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོད་དེ།
en: The Blessed One said the following to Vajrapāṇi, the great yakṣa commander: “O Vajrapāṇi, this stūpa of the Thus-Gone One, a heap of relics, contains a doctrinal synopsis for the stūpa of the dhāraṇī seal that is the quintessence of all the thus-gone ones, who are as numerous as ten million times the number of sesame seeds in a pod.

source: ལག་ན་རྡོ་རྗེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་ན་གནས་པ་དེར། དེ་བཞིན་གཤེགས་པ་འབུམ་ཕྲག་བྱེ་བ་ཏིལ་གྱི་གང་བུ་སྙེད་གནས་ཤིང་དེ་བཞིན་གཤེགས་པ་ཁར་ཡས་ཁར་ཡས་ཞེས་བྱ་བ་སྙེད་ཀྱི་སྐུ་གདུང་རིང་བསྲེལ་རྣམས་གནས་སོ།
en: O Vajrapāṇi, wherever this doctrinal synopsis resides, there are thus-gone ones as numerous as a hundred thousand times ten million times the number of sesame seeds in a pod, and relics of the bodily remains of the thus-gone ones too numerous to mention.

source: །ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གནས་སོ།
en: Eighty-four thousand compendiums of the doctrine reside there.

source: །དེ་བཞིན་གཤེགས་པ་འབུམ་ཕྲག་བྱེ་བ་ཏིལ་གྱི་གང་བུ་སྙེད་དགུ་བཅུ་རྩ་དགུའི་གཙུག་ཏོར་དང་། སྤྱི་བོ་ཡང་དེ་བཞིན་དུ་གནས་སོ།
en: Likewise, the uṣṇīṣas and the crowns of the heads of ninety-nine times the number of thus-gone ones who are as numerous as a hundred thousand times ten million times the number of sesame seeds in a pod also reside there.

source: །ལག་ན་རྡོ་རྗེ་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གནས་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དུ་ལུང་བསྟན་ཏོ།
en: O Vajrapāṇi, wherever this doctrinal synopsis resides is declared to be a stūpa of a thus-gone one.

source: །ལག་ན་རྡོ་རྗེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་འདི་ལྟར་ཕན་ཡོན་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཡིན་ནོ།
en: O Vajrapāṇi, these are the great beneficial qualities and the great power of this doctrinal synopsis.

source: །ལག་ན་རྡོ་རྗེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཕན་ཡོན་ཆེ་བ་ཡིན་ནོ།
en: O Vajrapāṇi, the beneficial qualities of this doctrinal synopsis are immense.

source: །ལག་ན་རྡོ་རྗེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བཀྲ་ཤིས་ཐམས་ཅད་རྫོགས་པར་བྱེད་པ་ཡིན་ནོ།
en: O Vajrapāṇi, this doctrinal synopsis consummates all auspiciousness.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལས་འཁོར་མང་པོ་འདུས་པ་དེ་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ལ། དེ་ནས་ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་ལོ།
en: When the many assemblies gathered there heard this doctrinal synopsis from the Blessed One, with regard to phenomena, they attained the dustless and stainless eye of the doctrine, and they were freed from the subsidiary afflictions.

source: །ཁ་ཅིག་གིས་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ།
en: Some of them attained the fruition of a stream enterer.

source: །ཁ་ཅིག་གིས་ནི་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ། །ཁ་ཅིག་གིས་ནི་རང་བྱང་ཆུབ་ཀྱི་འབྲས་བུའོ།
en: Some obtained the fruition of a worthy one, some the fruition of the enlightenment of a solitary buddha.

source: །ཁ་ཅིག་གིས་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུའོ།
en: Some attained the fruition of a non-returner.

source: །ཁ་ཅིག་གིས་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུའོ།
en: Some attained the fruition of a once-returner.

source: །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་གནས་སོ།
en: Some came to abide on the bodhisattva stages.

source: །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་བོ། །ཁ་ཅིག་གིས་ནི་ས་དང་པོའོ། །ཁ་ཅིག་གིས་ནི་ས་གཉིས་པའོ། །ཁ་ཅིག་གིས་ནི་ས་གསུམ་པའོ། །ཁ་ཅིག་གིས་ནི་ས་བཞི་པའོ།
en: Some obtained a prophecy concerning their enlightenment.

source: །ཁ་ཅིག་གིས་ནི་ས་ལྔ་པའོ།
en: Some came to abide on the first bodhisattva stage.

source: །ཁ་ཅིག་གིས་ནི་ས་དྲུག་པའོ། །ཁ་ཅིག་གིས་ནི་ས་བདུན་པའོ། །ཁ་ཅིག་གིས་ནི་ས་བརྒྱད་པའོ། །ཁ་ཅིག་གིས་ནི་ས་དགུ་པའོ། །ཁ་ཅིག་གིས་ནི་ས་བཅུ་པ་ལ་གནས་པར་གྱུར་ཏོ།
en: Some came to abide on the second stage, some on the third stage, some on the fourth, some on the fifth, some on the sixth, some on the seventh, some on the eighth, some on the ninth, and some on the tenth bodhisattva stage.

source: །ཁ་ཅིག་གིས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་སོ།
en: Some of them completed the six perfections.

source: །བྲམ་ཟེ་ཆེན་པོ་དེ་ཡང་མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་ཅིང་དྲི་མ་དང་བྲལ་བ་དང་། སེར་སྣ་དང་། ཕྲག་དོག་དང་བྲལ་བར་གྱུར་ཏོ།
en: The great brahmin, too, obtained the five supercognitions, was freed from stains, and was freed from avarice and jealousy.

source: །གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་ཆོ་འཕྲུལ་ཆེན་པོ་འདི་ལྟ་བུ་མཐོང་ནས་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བ་ཆེན་པོར་གྱུར་ཏེ།
en: The great yakṣa commander Vajrapāṇi, having beheld such a great miracle, was filled with wonder and amazement.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་མཚན་ཐོས་པས་ཀྱང་ཕན་ཡོན་གྱི་ཡོན་ཏན་གྱིས་བརྒྱན་པ་འདི་ལྟ་བུ་ཐོབ་ན། བཅོམ་ལྡན་འདས་གང་གི་སླད་དུ་ཕུ་དུད་དང་། བཀུར་སྟི་ཤིན་ཏུ་མང་པོ་བགྱིད་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: He asked the Blessed One, “If one obtains, O Blessed One, such an ornament of beneficial qualities by hearing the name of this doctrinal synopsis, what is there to say, O Blessed One, of extensively revering and honoring it?

source: བཅོམ་ལྡན་འདས་དེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་ལྟ་བུ་ཡང་མཐོང་བར་འགྱུར།
en: How might one, O Blessed One, view that aggregation of merit?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཉོན་ཅིག །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ།
en: The Blessed One responded, “Listen, Vajrapāṇi!

source: དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འདྲི་བར་བྱེད་ན། ལག་ན་རྡོ་རྗེ་དེས་དེ་བཞིན་གཤེགས་པ་འབུམ་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་ཏིལ་གྱི་གང་བུ་སྙེད་དགུ་བཅུ་རྩ་དགུའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་ལྡན་པར་འགྱུར་ཞིང་།
en: If a son or daughter of good family, a monk or nun, or a layman or laywoman writes down this doctrinal synopsis, they will generate the roots of virtue and will possess an aggregation of merit equal to that of ninety-nine times the number of thus-gone ones who are as numerous as a hundred thousand times ten million times a hundred billion times the number of sesame seeds in a pod.

source: དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱིས་རྗེས་སུ་བཟུང་བར་འགྱུར་རོ།
en: They will be cared for by those thus-gone ones.

source: །གང་ཞིག་ཀློག་པར་བྱེད་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པའི་མདོ་སྡེ་རྣམས་བཅང་བར་འགྱུར་རོ།
en: Those who read it will come to grasp the sūtras spoken by all the thus-gone ones.

source: །གང་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་འཛིན་པ་དེ་དག་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་འབུམ་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་ཏིལ་གྱི་གང་བུ་སྙེད་དགུ་བཅུ་རྩ་དགུ་དང་། ཕྱོགས་རེ་རེའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་གཟུང་བར་འགྱུར་ཞིང་། ཉིན་གཅིག་བཞིན་གཟིགས་པར་འགྱུར་རོ། །གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པ་བྱེད་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱེད་པ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། མེ་ཏོག་ཕྲེང་རྒྱུད་དང་། བྱུག་པ་དང་། ན་བཟའ་དང་། ལྷབ་ལྷུབ་དང་།
en: Those who hold this doctrinal synopsis are held and watched over, on a single day, by ninety-nine times the number of the thus-gone ones of the ten directions who are as numerous as a hundred thousand times ten million times a hundred billion times the number of sesame seeds in a pod, and by the thus-gone, worthy, completely perfect buddhas of each direction.

source: རྒྱན་གྱིས་མཆོད་པ་བྱེད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་དེས་ཕྱོགས་བཅུ་དང་། ཕྱོགས་རེ་རེའི་དེ་བཞིན་གཤེགས་པ་འབུམ་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་ཏིལ་གྱི་གང་བུ་སྙེད་དགུ་བཅུ་རྩ་དགུ་ལ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། མེ་ཏོག་ཕྲེང་རྒྱུད་དང་། བྱུག་པ་དང་། ན་བཟའ་དང་། ལྷབ་ལྷུབ་དང་།
en: Any son or daughter of a good family, or any layman or laywoman who worships this doctrinal synopsis, who assimilates it and offers it flowers, incense, perfumes, flower garlands, ointments, robes, decorations, and ornaments, will be offering divine substances consisting of flowers, incense, perfumes, flower garlands, ointments, robes, decorations, and ornaments to ninety-nine times the number of thus-gone ones in each of the ten directions who are as numerous as a hundred thousand times ten million times a hundred billion times the number of sesame seeds in a pod.

source: རྒྱན་གྱིས་མཆོད་པར་འགྱུར་རོ། །ཕྱོགས་རེ་རེའི་དེ་བཞིན་གཤེགས་པ་ལ་དེ་བཞིན་གཤེགས་པ་མཆོད་པའི་སྤྲིན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་རི་རབ་ཆེན་པོ་ཙམ་གྱི་ཕུང་པོའི་ཡོན་ཏན་བྱུང་བ་འབྱུང་བར་འགྱུར་རོ། །དེ་ནས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་།
en: Such clouds of a thus-gone one’s offerings presented before the thus-gone ones in each of the ten directions beget heaps of qualities, which in size are like a great Mount Meru made of the seven precious materials.”

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དེ་རྣམས་དང་། སེམས་ཅན་གྱི་ཚོགས་ཆེན་པོ་དེ་རྣམས་ཀྱང་ཡ་མཚན་དུ་གྱུར་ནས་གཅིག་ལ་གཅིག་འདི་སྐད་དུ་མཆོད་རྟེན་རྙིང་པ་ཕྱག་དར་དང་། གྱོ་མོའི་ཕུང་པོ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་ནས་འདི་ནི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ཆེན་པོ་སྟོན་པས་མཐུ་ཆེ་བ་ཡིན་ནོ་ཞེས་ཟེར་རོ།
en: The gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans, and all those in this great gathering of sentient beings, marveled and told one another, “This old stūpa, a heap of rubbish and gravel, has been blessed by the Thus-Gone One and thereby displayed such a great magical miracle.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Great is its power!” The great yakṣa commander, Vajrapāṇi, asked the Blessed One, “Who, O Blessed One, fashioned a precious stūpa from what had become a heap of rubbish?”

source: །བཅོམ་ལྡན་འདས་འདི་སུས་ཕྱག་དར་གྱི་ཕུང་པོར་བགྱིས་པ་ལས་རིན་པོ་ཆེའི་མཆོད་རྟེན་དུ་གདའ་བར་བགྱིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་འདི་ཕྱག་དར་གྱི་ཕུང་པོ་མ་ཡིན་གྱི་འདི་ནི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་རིན་པོ་ཆེའི་མཆོད་རྟེན་ཆེན་པོ་ཡིན་ནོ།
en: The Blessed One answered, “O Vajrapāṇi, this is not a heap of rubbish, but a great and precious stūpa made of the seven precious materials.

source: །ལག་ན་རྡོ་རྗེ་འོན་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་སྟོན་པས་ནུབ་པར་གྱུར་གྱི།
en: Yet it vanished from sight, O Vajrapāṇi, to show the maturation of the results of sentient beings’ deeds.

source: སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱི་སྙིང་པོའི་མཆོད་རྟེན་རྣམས་ནི་འཇིག་པའམ། འགྱེས་པར་མི་འགྱུར་ཏེ།
en: Stūpas containing the quintessence of the relics of the buddhas, the thus-gone ones, are never destroyed or dispersed.

source: དེ་བཞིན་གཤེགས་པའི་རྡོ་རྗེའི་སྙིང་པོའི་སྐུ་ཇི་ལྟར་འགྱེས་པར་འགྱུར།
en: How could the Thus-Gone One’s adamantine quintessence body be dispersed?

source: འོན་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པར་སྣང་བ་ལས་ཀྱང་ནུབ་པར་གྱུར་ཏོ།
en: Yet when the maturation of the results of sentient beings’ deeds appeared, the stūpa vanished from sight. “

source: །ལག་ན་རྡོ་རྗེ་གཞན་ཡང་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ། སྡིག་པ་ཀུན་ཏུ་སྤྱོད་པ་དང་། སྡིག་པ་ཅན་དང་། དམྱལ་བ་ལ་གཞོལ་བ་ཤིན་ཏུ་ཚབས་ཆེར་འབྱུང་བར་འགྱུར།
en: Furthermore, Vajrapāṇi, there will be a time in the future, exceedingly dire, when sentient beings will be engaged in evil, will be possessed of evil, and will descend to the hells.

source: སངས་རྒྱས་མ་ཡིན། ཆོས་མ་ཡིན། དགེ་འདུན་ཚོལ་བ་མ་ཡིན་ཞིང་དགེ་བའི་རྩ་བ་དག་ཀྱང་བསྐྱེད་པར་མི་བྱེད་དེ་རྒྱུ་དེ་དང་།
en: There will be neither Buddha nor Doctrine nor Community, and virtuous roots will not be generated.

source: རྐྱེན་དེས་དམ་པའི་ཆོས་ནུབ་བོ།
en: Due to these causes and conditions, the holy doctrine will vanish from sight.

source: །ལག་ན་རྡོ་རྗེ་དེའི་ཕྱིར་ངའི་མིག་གཉིས་མཆི་མས་གང་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་མཆི་མ་བྱུང་ངོ་།
en: That is why, Vajrapāṇi, my eyes filled with tears, and why all the thus-gone ones too were in tears.

source: །དམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་ནི་ནུབ་པར་འགྱུར་གྱི། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ནི་མ་གཏོགས་ཏེ། དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་རློབ་པར་འགྱུར་རོ།
en: Expositions of the holy doctrine such as this will have vanished from sight; there will only remain stūpas of a thus-gone one that are blessed by all the thus-gone ones.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྲིས་ཏེ་མཆོད་རྟེན་གྱི་ནང་དུ་འཇོག་ན་དགེ་བའི་རྩ་བ་ཅི་ཞིག་སྐྱེ་བར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The great yakṣa commander, Vajrapāṇi, then asked the Blessed One, “If, O Blessed One, someone writes down this doctrinal synopsis and places it inside a stūpa, what sort of virtuous roots will they produce?”

source: ལག་ན་རྡོ་རྗེ་གང་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྲིས་ཏེ་མཆོད་རྟེན་གྱི་ནང་དུ་བཞག་པ་དེ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྡོ་རྗེའི་སྙིང་པོ་རིང་བསྲེལ་གྱི་མཆོད་རྟེན་དུ་འགྱུར་རོ།
en: The Blessed One replied, “O Vajrapāṇi, if someone writes down this doctrinal synopsis and places it inside a stūpa, this will become a stūpa with relics that are the adamantine quintessence of all the thus-gone ones.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཟུངས་ཀྱི་སྙིང་པོ་གསང་བས་བྱིན་གྱིས་བརླབས་པའི་མཆོད་རྟེན་དུ་འགྱུར་རོ།
en: It will become a stūpa blessed by the secret quintessence of the dhāraṇī of all the thus-gone ones.

source: །དེ་བཞིན་གཤེགས་པ་ཏིལ་གྱི་གང་བུ་སྙེད་དགུ་བཅུ་རྩ་དགུའི་མཆོད་རྟེན་དུ་འགྱུར་རོ།
en: It will become a stūpa of ninety-nine times the number of thus-gone ones who are as numerous as there are sesame seeds in a pod.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཙུག་ཏོར་དང་། སྤྱན་གྱི་མཆོད་རྟེན་དུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: It will be blessed as a stūpa of the uṣṇīṣa and the eyes of all the thus-gone ones.
